app/Http/Controllers/CategoryKamarController.php

select * from `hotel` where `id_pembuat` = 27 limit 1
---
    public function create()
    {
        $user = auth()->user();
        $hotel = Hotel::where('id_pembuat', $user->id)->first();