app/Http/Controllers/HotelController.php

    public function index()
    {
        $user = auth()->user();
         //$hotel = Hotel::whereDate('created_at', Carbon::today())->get();
        if ($user->role == "superadmin") {
         $hotel = Hotel::with('categoriesHotel')->select('id','nama_hotel', 'category_hotel_id','kota','slug')->get();
        }elseif ($user->role == "admin") {
         $hotel = Hotel::with('categoriesHotel')->select('id','nama_hotel', 'category_hotel_id','kota','slug')->where('id_pembuat', $user->id)->first();
---
select `id`, `nama_hotel`, `category_hotel_id`, `kota`, `slug` from `hotel` where `id_pembuat` = 27 limit 1

        $fasilitas_text_hotel = [$request->fasilitas_text_hotel, $request->fasilitas_text_hotel1, $request->fasilitas_text_hotel2, $request->fasilitas_text_hotel3,$request->fasilitas_text_hotel4,$request->fasilitas_text_hotel5,];

        $ug = \Str::slug(request('nama_hotel'));
        $cel = Hotel::where('slug', $ug)->first();
---
select * from `hotel` where `slug` = 'teds-est' limit 1

    public function edit($slug)
    {
         $hotel = Hotel::where('slug', $slug)->first();
---
select * from `hotel` where `slug` = 'hotel-horizon' limit 1

    public function update(Request $request, $id)
    {

         $fasilitas_icon_hotel = [$request->fasilitas_icon_hotel, $request->fasilitas_icon_hotel1, $request->fasilitas_icon_hotel2, $request->fasilitas_icon_hotel3,$request->fasilitas_icon_hotel4,$request->fasilitas_icon_hotel5,];

        $fasilitas_text_hotel = [$request->fasilitas_text_hotel, $request->fasilitas_text_hotel1, $request->fasilitas_text_hotel2, $request->fasilitas_text_hotel3,$request->fasilitas_text_hotel4,$request->fasilitas_text_hotel5,];



        $hotel = Hotel::find($id);

        $ug = \Str::slug(request('nama_hotel'));
        $cel = Hotel::where('slug', $ug)->first();
---
select * from `hotel` where `slug` = 'hotel-horizon' limit 1

        $attr['slug'] = $slug;
        $attr['fasilitas_icon_hotel'] = json_encode($fasilitas_icon_hotel);
        $attr['fasilitas_text_hotel'] = json_encode($fasilitas_text_hotel);
        $hotel->update($attr);
---
update `hotel` set `fasilitas_icon_hotel` = '[\"fab fa-accessible-icon\",\"fas fa-address-book\",\"fas fa-ad\",\"fab fa-affiliatetheme\",\"fab fa-accusoft\",\"fab fa-accessible-icon\"]', `check_in` = '2020-11-15T00:43', `check_out` = '2020-11-15T00:46', `gambar_hotel2` = 'images/hotel/2.png', `hotel`.`updated_at` = '2020-11-15 00:41:13' where `id` = 6