app/Http/Controllers/LaporanReservasiConrtoller.php

select * from `category_kamar` where `id_pembuat` = 2
select * from `category_kamar` where `category_kamar`.`id` in (4)
select * from `reservasi` where `category_kamar_id` = 4 and `check_in` between '2020-11-01 00:00:01' and '2020-11-30 23:59:59' order by `created_at` desc
select * from `users` where `users`.`id` in (20)
---
    public function laporan_reservasi_pdf($daterange)
    {
     $user = auth()->user();
    $date = explode('+', $daterange); //EXPLODE TANGGALNYA UNTUK MEMISAHKAN START & END
    //DEFINISIKAN VARIABLENYA DENGAN FORMAT TIMESTAMPS
    $start = Carbon::parse($date[0])->format('Y-m-d') . ' 00:00:01';
    $end = Carbon::parse($date[1])->format('Y-m-d') . ' 23:59:59';

    //KEMUDIAN BUAT QUERY BERDASARKAN RANGE CREATED_AT YANG TELAH DITETAPKAN RANGENYA DARI $START KE $END
    $kamars = CategoryKamar::where('id_pembuat', $user->id)->get();

        foreach($kamars as $kamar){
            if($user->role == 'admin') {
                $histories[] = Reservasi::with('user', 'CategoryKamar')->where('category_kamar_id', $kamar->id)->whereBetween('check_in', [$start, $end])->latest()->get();