app/Http/Controllers/ReservasiController.php

select * from `category_kamar` where `id` = '4' limit 1
select * from `hotel` where `hotel`.`id` in (1)
select * from `kamar` where `kamar`.`category_id` in (4)
---
    public function reservasi_awal(Request $request)
    {

    	$request->validate([
    		'check_in' => 'required',
    		'waktu_check_in' => 'required',
        'durasi' => 'required|numeric',
    	]);

        $waktu = $request->waktu_check_in;
        $array_waktu = explode(":", $waktu);
        $jam = $array_waktu[0];
        $menit = $array_waktu[1];

        $check_out = date('Y-m-d H:i', strtotime('+'.$request->durasi.'day +'. $jam . 'hour +'.$menit . 'minutes',  strtotime($request->check_in)));

        $check_in = date('Y-m-d H:i', strtotime('+'. $jam . 'hour +'.$menit . 'minutes',  strtotime($request->check_in)));

        $cek_in = Carbon::parse($check_in)->format('d, F Y H:i');
        $cek_out = Carbon::parse($check_out)->format('d, F Y H:i');

		    $category = CategoryKamar::with('kamar','hotels')->where('id', $request->kamar_id)->first();

select * from `category_kamar` where `id` = '4' limit 1
select * from `hotel` where `hotel`.`id` in (1)
select * from `kamar` where `kamar`.`category_id` in (4)
select count(*) as aggregate from `reservasi` where `category_kamar_id` = 4 and `check_in` <= '2020-11-14 20:41:28' and `check_out` >= '2020-11-14 20:41:28'
---
    public function reservasi_akhir(Request $request)
    {


    $category = CategoryKamar::with('kamar','hotels')->where('id', $request->id)->first();
    $kamar = $category->kamar;
		$reservasi = Reservasi::where('category_kamar_id', $category->id)->where('check_in','<=', Carbon::now())->where('check_out','>=', Carbon::now())->count();