app/Http/Controllers/ReviewController.php

   public function index($email)
    {
    	$user = User::where('email', $email)->first();
    	$reviews = Reservasi::with('categorykamar')->where('user_id', $user->id)->get();
---
select * from `users` where `email` = 'teguh.iqbal69@gmail.com' limit 1
select * from `category_kamar` where `category_kamar`.`id` in (4, 24)
select * from `reservasi` where `user_id` = 20