app/Http/Controllers/SiteController.php

select * from `hotel` limit 6
select * from `category_kamar` limit 3
select `harga` from `category_kamar` where `hotel_id` = 1 order by `harga` asc limit 1
---
   public function home()
   {

      $negara = CategoryHotel::get();
    $hotel = Hotel::take(6)->with('CategoriesKamar')->get();
    $kamar = CategoryKamar::take(3)->get();
    $harga = [];
    foreach($hotel as $ht){
        $harga[] = CategoryKamar::where('hotel_id',$ht->id)->select('harga')->orderBy('harga','asc')->first();

select * from `hotel` where `slug` = 'hotel-vegas' limit 1
select * from `category_kamar` where `hotel_id` = 1
select * from `diskon` where `diskon`.`kamar_id` in (4, 24)
select * from `kamar` where `kamar`.`category_id` in (4, 24)
select * from `reviews` where `hotel_id` = 1
select count(*) as aggregate from `reservasi` where `category_kamar_id` = 4 and `check_in` <= '2020-11-10 18:23:52' and `check_out` >= '2020-11-10 18:23:52'
---
   public function detail_hotel($slug)
   {

   	$hotel = Hotel::with('CategoriesHotel')->where('slug', $slug)->first();
    $category = CategoryKamar::with('kamar', 'diskon')->where('hotel_id', $hotel->id)->get();

    $reviews = Review::where('hotel_id', $hotel->id)->get();
    $icon_hotel = json_decode($hotel->fasilitas_icon_hotel, TRUE);
    $fasilitas_hotel = json_decode($hotel->fasilitas_text_hotel, TRUE);


    $no = 0;
    foreach ($category as $ct)
      {

    $icon[] = json_decode($ct->kamar->fasilitas_icon_kamar , TRUE);
    $fasilitas[] = json_decode($ct->kamar->fasilitas_text_kamar , TRUE);

    // Jumlah Stock Kamar
    $reservasi[] = Reservasi::where('category_kamar_id', $ct->id)->where('check_in','<=', Carbon::now())->where('check_out','>=', Carbon::now())->count();

select * from `hotel` limit 3
select `harga` from `category_kamar` where `hotel_id` = 1 order by `harga` asc limit 1
---
   public function about()
   {

    $negara = CategoryHotel::get();
    $hotel = Hotel::take(3)->with('CategoriesKamar')->get();
    $harga = [];
    foreach($hotel as $ht){
        $harga[] = CategoryKamar::where('hotel_id',$ht->id)->select('harga')->orderBy('harga','asc')->first();